#### ExtElemChangeBeamSectionRegistry Members

---

|  |
| --- |
| ExtElemChangeBeamSectionRegistry Class   Methods   Properties   See Also |

The  ExtElemChangeBeamSectionRegistry  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  ExtElemChangeBeamSectionRegistry |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method Static member | RegisterInterface | Registers a IExtElemChangeBeamSection |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |
| Public method Static member | Unregister | Unregisters IExtElemChangeBeamSection. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

ExtElemChangeBeamSectionRegistry Class

Autodesk.Revit.DB.Structure Namespace